<template>
  <b-card v-if="!$route.query.template">
    <div class="table-responsive">
      <table class="table table-centered table-custom-bordered">
        <thead>
          <tr>
            <th class="text-center" style="width: 10px !important">№</th>

            <th class="text-center">{{ $t("submodules.templates_row.nm") }}</th>
            <th class="text-center">{{ $t("titleTable") }}</th>
            <th class="text-center">{{ $t("conditionTable") }}</th>
            <th style="width: 14% !important" class="text-center">
              {{ $t("column.actions") }}
            </th>
          </tr>
        </thead>
        <tbody>
          <tr
            class="tr-text-center"
            v-for="(table, index) in options"
            :key="index + 'static'"
          >
            <td class="text-center" style="width: 10px !important">
              {{ index + 1 }}
            </td>
            <td style="width: 10%">
              {{ table.name }}
            </td>
            <td>
              {{ table.title }}
            </td>
            <td>
              {{ table.condition }}
            </td>
            <td>
              <b-button
                @click="$emit('share', table)"
                size="sm"
                variant="primary"
              >
                <i class="bx bx-plus font-size-18"> </i>
              </b-button>

              <b-button :to="table.link" size="sm" variant="light" class="ml-2">
                <i class="fa fa-eye font-size-18"></i>
              </b-button>
            </td>
          </tr>
        </tbody>
      </table>
    </div>
  </b-card>
</template>

<script>
import { enc } from "@/helper";
export default {
  computed: {
    options() {
      return [
        {
          link: `/report/templates/${enc(this.shakl_5A_id)}/5A_shakl`,
          id: this.shakl_5A_id,
          name: "5А-шакл",
          title:
            "Судларга киритилган даъво аризаларининг ташкилотлар кесими бўйича",
          condition:
            "2-устун cони ва суммаси 3-6 устунлар сони ва суммаси йиғиндисига, 1-2 устунлар сони 9, 20, 22, 24, 26-устунлар сони йиғиндисига, 9-устундаги даъво аризалари суммаси 12-13 устунлар суммасига тенг",
        },

        {
          link: `/report/templates/${enc(this.shakl_17_id)}/17_shakl`,
          id: this.shakl_17_id,
          name: "17-шакл",
          title:
            "Адлия органлари ва муассасалари томонидан ўтказилган ҳуқуқий тарғибот тадбирлари тўғрисида",
          condition:
            "1-устун 2-5 устунлар йиғиндисига, 6-устун 7-11-устунлар йиғиндисига, 13-16-устунлар йиғиндисига, 18-устун 20, 22-устунлар йиғиндисига, 19-устун 21, 23-устунлар йиғиндисига, 24-устун 26, 28, 30-устунлар йиғиндисига, 25-устун 27, 29-устунлар йиғиндисига, 31-устун 1, 6, 18, 24-устунлар йиғиндисига тенг",
        },

        {
          link: `/report/templates/${enc(this.shakl_2B_id)}/2B_shakl`,
          id: this.shakl_2B_id,
          name: "2В-шакл",
          title:
            "Жисмоний шахслар ва юридик шахслар вакилларини шахсий қабул қилиш тўғрисида",
          condition:
            "1-қатор 2-4-қаторлар йиғиндисига, 5-қатор 6-12 қаторлар йиғиндисига, 1 ва 2-устунлар йиғиндиси 4, 8, 9, 12-устунлар йиғиндисига, 4-устун 5, 6, 7-устунлар йиғиндисига тенг",
        },

        {
          link: `/report/templates/${enc(this.shakl_2Б_id)}/2Б_shakl`,
          id: this.shakl_2Б_id,
          name: "2Б-шакл",
          title:
            "Тошкент давлат юридик университетининг Ихтисослаштирилган филиали раҳбарияти томонидан жисмоний шахсларни шахсий қабул қилиш тўғрисида",
          condition:
            "(1-қатор 2-5-қаторлар йиғиндисига, 6-қатор йиғиндиси 7-12 қаторлар йиғиндисига, 1 ва 2-устунлар йиғиндиси 4, 8, 9, 12-устунлар йиғиндисига, 4-устун 5, 6, 7-устунлар йиғиндисига тенг)",
        },

        {
          link: `/report/templates/${enc(this.shakl_5_id)}/5_shakl`,
          id: this.shakl_5_id,
          name: "5-шакл",
          title: "Судларга киритилган даъво аризалари тўғрисида ",
          condition:
            "(2-устун cони ва суммаси 3-6 устунлар сони ва суммаси йиғиндисига, 1-2 устунлар сони 9, 20, 22, 24, 26-устунлар сони йиғиндисига, 9-устундаги даъво аризалари суммаси 12-13 устунлар суммасига тенг)",
        },

        {
          link: `/report/templates/${enc(this.shakl_16_id)}/16_shakl`,
          id: this.shakl_16_id,
          name: "16-шакл	",
          title:
            "Нодавлат нотижорат ва диний ташкилотларни давлат, ҳисоб ва қайта рўйхатдан ўтказиш, уларни тугатиш ҳамда ННТлар рамзларини давлат рўйхатидан ўтказиш, ННТ чет эл фуқаролари бўлган ходимларини, шунингдек уларнинг қарамоғидаги оила аъзоларини белгиланган тартибда аккредитация қилиш бўйича келиб тушган аризалар ҳақида",
          condition: `(1-4 устунлар йиғиндиси 5-10 устунлар йиғиндисига, 1 ва 3 устун йиғиндиси 5-7 устунлар йиғиндисига, 2 ва 4 устунлар йиғиндиси 8-10 устунлар йиғиндисига, 11-14 устунлар йиғиндиси 15-20 устунлар йиғиндисига, 11 ва 13 устунлар йиғиндиси 15-17 устунлар йиғиндисига, 12 ва 14 устунлар йиғиндиси 18-20 устунлар йиғиндисига,
          21-22 устунлар йиғиндиси 23-24 устунлар йиғиндисига, 25-26 устунлар йиғиндиси 27-28 устунлар йиғиндисига, 29-30 устунлар йиғиндиси
31-33 устунлар йиғиндисига, 34-35 устунлар йиғиндиси 36-41 устунлар йиғиндисига, 42-43устунлар йиғиндиси 44-49 устунлар йиғиндисига, 50-51 устунлар йиғиндиси 52-57 устунлар йиғиндисига, 58-59 устунлар йиғиндиси 60-62 устунлар йиғиндисига тенг бўлиши керак)`,
        },

        {
          link: `/report/templates/${enc(this.shakl_16A_id)}/16A_shakl`,
          id: this.shakl_16A_id,
          name: "16A-шакл",
          title:
            "Адлия органлари томонидан давлат рўйхатидан ўтган нодавлат нотижорат ташкилотлари фаолиятини назорат қилиш бўйича",
          condition: ``,
        },



        {
          link: `/report/templates/${enc(this.shakl_16Б_id)}/16Б_shakl`,
          id: this.shakl_16Б_id,
          name: "16Б-шакл",
          title:
            "Ҳудудий адлия органларида ҳисоб рўйхатидан ўтган ННТлар фаолиятини назорат қилиш тўғрисида",
          condition: ``,
        },
      ];
    },
  },
};
</script>

<style>
</style>
